# Практическая работа №3: Циклы в C#
## Вариант 1: Таблица умножения

### Цель работы
Сформировать практические навыки использования циклов в языке C#.

### Задачи
- Изучить цикл for.
- Обрабатывать ввод пользователя.
- Вывести таблицу умножения для заданного числа.

### Задание
Написать программу, которая выводит на экран таблицу умножения (от 1 до 10) для числа, введенного пользователем.  
Использовать цикл for.

### Инструкция по запуску
1. Открыть терминал.
2. Перейти в папку `Pr03`.
3. Выполнить команду `dotnet run`.
4. Ввести число от 1 до 10.

### Логика решения
- Считываем ввод пользователя.
- Проверяем, что это число в диапазоне от 1 до 10.
- Используем цикл for от 1 до 10 для вычисления произведений и вывода результата.

### Примеры запуска
- **test_1.png** — пользователь ввёл `2`, программа вывела таблицу умножения на 2.
- **test_2.png** — пользователь ввёл `10`, программа вывела таблицу умножения на 10.



using System;

class Program
{
    static void Main()
    {
        Console.Write("Введите число для вывода таблицы умножения (1-10): ");
        string input = Console.ReadLine();

        if (!int.TryParse(input, out int number))
        {
            Console.WriteLine("Ошибка: введено не число.");
            return;
        }

        if (number < 1 || number > 10)
        {
            Console.WriteLine("Ошибка: число должно быть от 1 до 10.");
            return;
        }

        Console.WriteLine($"\nТаблица умножения для {number}:");

        // Цикл for от 1 до 10
        for (int i = 1; i <= 10; i++)
        {
            int result = number * i;
            Console.WriteLine($"{number} × {i} = {result}");
        }
    }
}
